Revit 2026 API

# ConnectorMEPSystem Property

---

The system of the connector belong to.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPSystem MEPSystem { get; }
```
```vb
Public ReadOnly Property MEPSystem As MEPSystem
	Get
```
```cpp
public:
property MEPSystem^ MEPSystem {
	MEPSystem^ get ();
}
```
```fsharp
member MEPSystem : MEPSystem with get
```

#### Property Value

MEPSystem

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown on failure to get system. |

#### Reference

Connector Class

Autodesk.Revit.DB Namespace